# One Hot Encoding and Dummy Variables

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("Diwali Sales Data.csv", encoding='latin1')

In [4]:
df.head(3)

,User_ID,Cust_name,Product_ID,Gender,Age Group,Age,Marital_Status,State,Zone,Occupation,Product_Category,Orders,Amount,Status,unnamed1
0,1002903,Sanskriti,P00125942,F,26-35,28,0,Maharashtra,Western,Healthcare,Auto,1,23952.0,NaN,NaN
1,1000732,Kartik,P00110942,F,26-35,35,1,Andhra Pradesh,Southern,Govt,Auto,3,23934.0,NaN,NaN
2,1001990,Bindu,P00118542,F,26-35,35,1,Uttar Pradesh,Central,Automobile,Auto,3,23924.0,NaN,NaN

In [5]:
df.isnull().sum()

User_ID                 0
Cust_name               0
Product_ID              0
Gender                  0
Age Group               0
Age                     0
Marital_Status          0
State                   0
Zone                    0
Occupation              0
Product_Category        0
Orders                  0
Amount                 12
Status              11251
unnamed1            11251
dtype: int64

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 15 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   User_ID           11251 non-null  int64
 1   Cust_name         11251 non-null  object
 2   Product_ID        11251 non-null  object
 3   Gender            11251 non-null  object
 4   Age Group         11251 non-null  object
 5   Age               11251 non-null  int64
 6   Marital_Status    11251 non-null  int64
 7   State             11251 non-null  object
 8   Zone              11251 non-null  object
 9   Occupation        11251 non-null  object
 10  Product_Category  11251 non-null  object
 11  Orders            11251 non-null  int64
 12  Amount            11239 non-null  float64
 13  Status            0 non-null      float64
 14  unnamed1          0 non-null      float64
dtypes: float64(3), int64(4), object(8)
memory usage: 1.3+ MB

In [19]:
df.select_dtypes(include='object').columns

Index(['Cust_name', 'Product_ID', 'Gender', 'Age Group', 'State', 'Zone',
       'Occupation', 'Product_Category', 'Status'],
      dtype='object')

In [8]:
df['Gender'].isnull().sum().sum()

0

In [9]:
df.columns

Index(['User_ID', 'Cust_name', 'Product_ID', 'Gender', 'Age Group', 'Age',
       'Marital_Status', 'State', 'Zone', 'Occupation', 'Product_Category',
       'Orders', 'Amount', 'Status', 'unnamed1'],
      dtype='object')

In [10]:
df['Age Group'].isnull().sum()

0

In [15]:
df['Status'] =df['Status'].fillna('Independent')

In [17]:
en_data = df[['Gender', 'Age Group']]
en_data

      Gender Age Group
0          F     26-35
1          F     26-35
2          F     26-35
3          M      0-17
4          M     26-35
...      ...       ...
11246      M     18-25
11247      M     26-35
11248      F     36-45
11249      M     36-45
11250      F     18-25

[11251 rows x 2 columns]

In [21]:
# Get Dummy 
pd.get_dummies(en_data).info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 11251 entries, 0 to 11250
Data columns (total 9 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Gender_F         11251 non-null  bool
 1   Gender_M         11251 non-null  bool
 2   Age Group_0-17   11251 non-null  bool
 3   Age Group_18-25  11251 non-null  bool
 4   Age Group_26-35  11251 non-null  bool
 5   Age Group_36-45  11251 non-null  bool
 6   Age Group_46-50  11251 non-null  bool
 7   Age Group_51-55  11251 non-null  bool
 8   Age Group_55+    11251 non-null  bool
dtypes: bool(9)
memory usage: 99.0 KB

In [22]:
from sklearn.preprocessing import OneHotEncoder

In [29]:
ohe = OneHotEncoder(drop='first')
ohe.fit_transform(en_data)

<11251x7 sparse matrix of type '<class 'numpy.float64'>'
	with 14364 stored elements in Compressed Sparse Row format>

In [30]:
 ar = ohe.fit_transform(en_data).toarray()

In [33]:
pd.DataFrame(ar, columns=['Gender_M','Age Group_18-25','Age Group_26-35','Age Group_36-45','Age Group_46-50','Age Group_51-55','Age Group_55+'])

,Gender_M,Age Group_18-25,Age Group_26-35,Age Group_36-45,Age Group_46-50,Age Group_51-55,Age Group_55+
0,0.0,0.0,1.0,0.0,0.0,0.0,0.0
1,0.0,0.0,1.0,0.0,0.0,0.0,0.0
2,0.0,0.0,1.0,0.0,0.0,0.0,0.0
3,1.0,0.0,0.0,0.0,0.0,0.0,0.0
4,1.0,0.0,1.0,0.0,0.0,0.0,0.0
...,...,...,...,...,...,...,...
11246,1.0,1.0,0.0,0.0,0.0,0.0,0.0
11247,1.0,0.0,1.0,0.0,0.0,0.0,0.0
11248,0.0,0.0,0.0,1.0,0.0,0.0,0.0
11249,1.0,0.0,0.0,1.0,0.0,0.0,0.0
11250,0.0,1.0,0.0,0.0,0.0,0.0,0.0